tutorials/combustion/fireFoam/les/smallPoolFire2D/0/IDefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      IDefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type            greyDiffusiveRadiation;
        T               T;
        emissivity      1.0
        value           uniform 0;
    }
    sides
    {
        type            greyDiffusiveRadiation;
        T               T;
        emissivity      1.0
        value           uniform 0;
    }
    base
    {
        type            greyDiffusiveRadiation;
        T               T;
        emissivity      1.0
        value           uniform 0;
    }
    inlet
    {
        type            greyDiffusiveRadiation;
        T               T;
        emissivity      1.0
        value           uniform 0;
    }
    frontAndBack
    {
        type        empty;
    }
}

// ************************************************************************* //
